mutants/exch-01-sell-at-best-bid-does-not-trade.patch
# mutant: exch-01-sell-at-best-bid-does-not-trade
# file: src/exchange.hpp
# rule: a sell limit at price p crosses every resting bid with price >= p
# breaks: strict inequality on the sell side, so a sell AT the best bid rests
#         instead of trading and the book is crossed (bid == ask both resting)
# expected killer: test_exchange unit_sell_at_bid (test_exchange.cpp:62-64);
#                  the chaos layer's uncrossed-book invariant in every universe
# provenance: reconstructed (README "the one-character sell-side mirror of a
#             fully-pinned buy-side rule"; test_exchange.cpp:62-64)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -169,7 +169,7 @@
             while (qty > 0 && !asks_.empty() && asks_.begin()->first <= px)
                 take(fills, id, qty, asks_);
         } else {
-            while (qty > 0 && !bids_.empty() && bids_.begin()->first >= px)
+            while (qty > 0 && !bids_.empty() && bids_.begin()->first > px)
                 take(fills, id, qty, bids_);
         }
         if (qty > 0) {                       // remainder rests
