mutants/raft-03-stale-vote-counted-across-terms.patch
# mutant: raft-03-stale-vote-counted-across-terms
# file: src/raft.hpp
# rule: figure 2 candidate rule: a vote counts toward the election of the term
#       it was requested in; replies from a previous election are stale
# breaks: the candidate tallies any granted reply regardless of its term, so
#         yesterday's votes delayed past the election timeout can elect a
#         leader with no current-term majority (Election Safety hole)
# expected killer: test_raft unit_stale_vote_count (test_raft.cpp:326-330);
#                  scenario slow_wire (400 ms delays > election timeout,
#                  test_raft.cpp:660-664) via invariant 1 (two leaders in a term)
# provenance: reconstructed (README round 2 "dropping the term guard on vote
#             counting", survivor at 3,950 universes)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -294,8 +294,7 @@
             become_follower(r.term, now_ms);
             return;
         }
-        if (role_ == Role::Candidate && r.term == p_.current_term &&
-            r.granted) {
+        if (role_ == Role::Candidate && r.granted) {
             votes_[m.from] = true;
             maybe_win(now_ms, out);
         }
