mutants/raft-07-uptodate-index-tiebreak-dropped.patch
# mutant: raft-07-uptodate-index-tiebreak-dropped
# file: src/raft.hpp
# rule: section 5.4.1 up-to-date check: same last term -> the LONGER log wins
# breaks: the index half of the comparison is dropped, so a voter with the
#         same last term grants to a candidate with a shorter log, which can
#         elect a leader missing committed entries
# expected killer: test_raft unit_uptodate_index ("same last term, shorter log
#                  must be denied", test_raft.cpp:401-403); the comment records
#                  that one lossy seed in 450 was the only thing catching it
# provenance: reconstructed (test_raft.cpp:401-403)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -277,7 +277,7 @@
         bool up_to_date =
             r.last_log_term > last_term() ||
             (r.last_log_term == last_term() &&
-             r.last_log_index >= last_index());
+             true);
         if (r.term == p_.current_term && up_to_date &&
             (!p_.voted_for || *p_.voted_for == r.candidate)) {
             p_.voted_for = r.candidate;
