mutants/exch-02-buy-at-best-ask-does-not-trade.patch
# mutant: exch-02-buy-at-best-ask-does-not-trade
# file: src/exchange.hpp
# rule: a buy limit at price p crosses every resting ask with price <= p
# breaks: strict inequality on the buy side, so a buy AT the best ask rests
#         and the book is crossed
# expected killer: test_exchange unit_fifo_within_level (buy 100 vs asks at 100),
#                  unit_accounting; the chaos uncrossed-book invariant
# provenance: candidate (the buy-side rule the README calls "fully pinned")
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -166,7 +166,7 @@
                             std::int64_t qty, bool buy) {
         std::vector<Fill> fills;
         if (buy) {
-            while (qty > 0 && !asks_.empty() && asks_.begin()->first <= px)
+            while (qty > 0 && !asks_.empty() && asks_.begin()->first < px)
                 take(fills, id, qty, asks_);
         } else {
             while (qty > 0 && !bids_.empty() && bids_.begin()->first >= px)
