mutants/raft-08-uptodate-term-half-dropped.patch
# mutant: raft-08-uptodate-term-half-dropped
# file: src/raft.hpp
# rule: section 5.4.1 up-to-date check: compare LAST TERM first, index second
# breaks: the voter compares log length only, so a candidate with a longer
#         log of stale terms beats one holding the newer committed entry
# expected killer: test_raft unit_stale_ae_reply ("M leads term 4": M's
#                  election there needs F to grant on last TERM, since F's
#                  log is longer) and test_exchange scenario_replicated_book
#                  (seed 14, n=3) via the ledger invariant.
#                  NOTE: as the suite stood before unit_stale_ae_reply, test_raft
#                  did NOT kill this one: the old comment at unit_uptodate_index
#                  said the term half is pinned by figure8, but unit_figure8 and
#                  all 4,550 seeded universes passed with this mutant applied.
# provenance: candidate (see mutants/README.md, "what the table taught")
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -274,10 +274,7 @@
         // Grant iff same term, vote free (or repeat), and candidate's log is
         // at least as up-to-date (section 5.4.1: compare last term, then
         // last index).
-        bool up_to_date =
-            r.last_log_term > last_term() ||
-            (r.last_log_term == last_term() &&
-             r.last_log_index >= last_index());
+        bool up_to_date = r.last_log_index >= last_index();
         if (r.term == p_.current_term && up_to_date &&
             (!p_.voted_for || *p_.voted_for == r.candidate)) {
             p_.voted_for = r.candidate;
