mutants/exch-03-volume-halved.patch
# mutant: exch-03-volume-halved
# file: src/exchange.hpp
# rule: matched volume is the sum of traded quantities
# breaks: every fill adds half its quantity -- deterministically, on every
#         replica, so cross-replica equality cannot see it
# expected killer: test_exchange unit_accounting ("volume equals traded
#                  quantity", test_exchange.cpp:105-107)
# provenance: reconstructed (README/test comment: "every replica halves the
#             volume identically. Only absolute assertions kill that class")
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -209,7 +209,7 @@
         fold(static_cast<std::uint64_t>(f.px));
         fold(static_cast<std::uint64_t>(f.qty));
         ++n_fills_;
-        volume_ += static_cast<std::uint64_t>(f.qty);
+        volume_ += static_cast<std::uint64_t>(f.qty) / 2;
     }
 
     void note_reject() { ++rejected_; }
