mutants/raft-09-vote-grant-does-not-reset-timer.patch
# mutant: raft-09-vote-grant-does-not-reset-timer
# file: src/raft.hpp
# rule: figure 2 follower rule: reset the election timer when "granting vote
#       to candidate", not only on AppendEntries from the leader
# breaks: a voter keeps its old deadline after granting, so it campaigns
#         against the candidate it just voted for (term inflation, split votes)
# expected killer: test_raft unit_grant_deadline_reset
# provenance: candidate (rule and test are in the tree; not named as one of
#             the twelve)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -282,7 +282,6 @@
             (!p_.voted_for || *p_.voted_for == r.candidate)) {
             p_.voted_for = r.candidate;
             rr.granted = true;
-            deadline_ = now_ms + timeout_ms_;   // granting a vote resets timer
         }
         reply.rvr = rr;
         out.push_back(reply);
