mutants/exch-04-fill-price-left-out-of-hash.patch
# mutant: exch-04-fill-price-left-out-of-hash
# file: src/exchange.hpp
# rule: the state hash covers the fill STREAM (taker, maker, price, qty), not
#       just the resting book and counters
# breaks: note_fill() stops folding the fill price, so two replicas with the
#         same book and counts but fills at different prices hash equal
# expected killer: test_exchange unit_hash_covers_fills (test_exchange.cpp:120-122)
# provenance: reconstructed (test_exchange.cpp:120-122)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -206,7 +206,6 @@
             }
         };
         fold(f.taker); fold(f.maker);
-        fold(static_cast<std::uint64_t>(f.px));
         fold(static_cast<std::uint64_t>(f.qty));
         ++n_fills_;
         volume_ += static_cast<std::uint64_t>(f.qty);
