mutants/exch-05-rejections-not-counted.patch
# mutant: exch-05-rejections-not-counted
# file: src/exchange.hpp
# rule: every rejected command is counted state (a rejection moves the hash)
# breaks: note_reject() no longer increments rejected_, so malformed input
#         leaves no trace in the observable state
# expected killer: test_exchange unit_deterministic_rejection ("every rejection
#                  is counted"), unit_cancel ("even a rejected command moves the
#                  hash"), unit_golden_vector
# provenance: candidate
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -212,7 +212,7 @@
         volume_ += static_cast<std::uint64_t>(f.qty);
     }
 
-    void note_reject() { ++rejected_; }
+    void note_reject() {}
 
     std::map<std::int64_t, std::deque<Order>, std::greater<std::int64_t>>
         bids_;
