mutants/exch-06-lifo-within-level.patch
# mutant: exch-06-lifo-within-level
# file: src/exchange.hpp
# rule: time priority: within a price level, the earliest resting order fills
#       first (FIFO)
# breaks: a resting remainder is pushed to the FRONT of its level, so the
#         newest order at a price fills first
# expected killer: test_exchange unit_fifo_within_level ("same price fills in
#                  arrival order"), unit_golden_vector
# provenance: candidate
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -173,8 +173,8 @@
                 take(fills, id, qty, bids_);
         }
         if (qty > 0) {                       // remainder rests
-            if (buy) bids_[px].push_back({id, qty});
-            else asks_[px].push_back({id, qty});
+            if (buy) bids_[px].push_front({id, qty});
+            else asks_[px].push_front({id, qty});
             index_[id] = {buy, px};
         }
         return fills;
