mutants/exch-07-open-id-collision-accepted.patch
# mutant: exch-07-open-id-collision-accepted
# file: src/exchange.hpp
# rule: order ids are unique among OPEN orders; a new order reusing an open id
#       is rejected
# breaks: the admission check drops the index_ lookup, so a colliding id is
#         accepted and index_[id] is silently overwritten (a later cancel then
#         acts on the wrong order)
# expected killer: test_exchange unit_deterministic_rejection ("id collides
#                  with an open order" no longer counted), unit_golden_vector
# provenance: candidate
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -66,7 +66,7 @@
                       (*p == 'B' || *p == 'S') && (side = *p++, true) &&
                       eat(p, end, ' ') && num(p, end, px, kMaxPx) &&
                       eat(p, end, ' ') && num(p, end, qty, kMaxQty) &&
-                      p == end && px > 0 && qty > 0 && !index_.count(id);
+                      p == end && px > 0 && qty > 0;
             if (!ok) { note_reject(); return fills; }
             fills = match(id, static_cast<std::int64_t>(px),
                           static_cast<std::int64_t>(qty), side == 'B');
