mutants/exch-08-partial-fill-overfills-taker.patch
# mutant: exch-08-partial-fill-overfills-taker
# file: src/exchange.hpp
# rule: a fill trades min(taker remaining, maker resting)
# breaks: take() always trades the maker's full quantity, so a small taker
#         is over-filled and the maker is removed with quantity it never traded
# expected killer: test_exchange unit_price_time_priority ("remainder walks to
#                  the next level" expects qty 3), unit_fifo_within_level,
#                  unit_golden_vector
# provenance: candidate
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -186,7 +186,7 @@
         auto lvl = book.begin();             // best price, FIFO within it
         auto& q = lvl->second;
         Order& maker = q.front();
-        std::int64_t traded = qty < maker.qty ? qty : maker.qty;
+        std::int64_t traded = maker.qty;
         fills.push_back({taker, maker.id, lvl->first, traded});
         note_fill(fills.back());
         qty -= traded;
