mutants/exch-09-filled-maker-id-not-released.patch
# mutant: exch-09-filled-maker-id-not-released
# file: src/exchange.hpp
# rule: a fully filled maker leaves the book AND the open-order index
# breaks: take() pops the maker from its level but leaves its id in index_,
#         so open_orders() overcounts and the id can never be reused
# expected killer: test_exchange unit_price_time_priority ("partially filled
#                  maker still resting" expects open_orders()==1),
#                  unit_sell_at_bid, unit_cancel
# provenance: candidate
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -192,7 +192,6 @@
         qty -= traded;
         maker.qty -= traded;
         if (maker.qty == 0) {
-            index_.erase(maker.id);
             q.pop_front();
             if (q.empty()) book.erase(lvl);
         }
