mutants/exch-10-price-admission-bound-dropped.patch
# mutant: exch-10-price-admission-bound-dropped
# file: src/exchange.hpp
# rule: price is admission-bounded (<= 1e9) so downstream arithmetic is
#       provably in range
# breaks: the price parser accepts any uint64, so an out-of-bound price is
#         admitted instead of rejected
# expected killer: test_exchange unit_deterministic_rejection ("price above the
#                  admission bound" no longer counted as a rejection)
# provenance: candidate
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -64,7 +64,7 @@
             bool ok = eat(p, end, ' ') && num(p, end, id, ~0ULL) &&
                       eat(p, end, ' ') && p != end &&
                       (*p == 'B' || *p == 'S') && (side = *p++, true) &&
-                      eat(p, end, ' ') && num(p, end, px, kMaxPx) &&
+                      eat(p, end, ' ') && num(p, end, px, ~0ULL) &&
                       eat(p, end, ' ') && num(p, end, qty, kMaxQty) &&
                       p == end && px > 0 && qty > 0 && !index_.count(id);
             if (!ok) { note_reject(); return fills; }
