mutants/exch-11-trailing-bytes-accepted.patch
# mutant: exch-11-trailing-bytes-accepted
# file: src/exchange.hpp
# rule: the command grammar is canonical: no trailing bytes after the quantity
# breaks: the "N" parser no longer requires end-of-input, so "N 6 B 100 5extra"
#         and "N 7 B 100 5 " are accepted as valid orders
# expected killer: test_exchange unit_deterministic_rejection, unit_golden_vector
#                  (the golden script carries "N 8 B 100 5extra")
# provenance: candidate
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -66,7 +66,7 @@
                       (*p == 'B' || *p == 'S') && (side = *p++, true) &&
                       eat(p, end, ' ') && num(p, end, px, kMaxPx) &&
                       eat(p, end, ' ') && num(p, end, qty, kMaxQty) &&
-                      p == end && px > 0 && qty > 0 && !index_.count(id);
+                      px > 0 && qty > 0 && !index_.count(id);
             if (!ok) { note_reject(); return fills; }
             fills = match(id, static_cast<std::int64_t>(px),
                           static_cast<std::int64_t>(qty), side == 'B');
