mutants/exch-12-cancel-leaves-order-resting.patch
# mutant: exch-12-cancel-leaves-order-resting
# file: src/exchange.hpp
# rule: cancel removes the order from its price level
# breaks: cancel releases the id from the index but never erases the order
#         from its level, so a "cancelled" order keeps resting and still trades
# expected killer: test_exchange unit_cancel ("cancelled order cannot trade;
#                  aggressor rests"), unit_golden_vector
# provenance: candidate. (A sibling candidate, cancel looking up the OPPOSITE
#             side, was tried and rejected: unit_cancel does not detect it,
#             and its only kill was a segfault in the chaos layer through an
#             empty-deque front(), i.e. undefined behaviour, which is not a
#             kill the gate may rely on. See mutants/README.md.)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/exchange.hpp
+++ b/src/exchange.hpp
@@ -77,8 +77,6 @@
             if (!ok) { note_reject(); return fills; }
             auto [buy, px] = index_[id];
             auto& q = buy ? bids_[px] : asks_[px];
-            for (auto it = q.begin(); it != q.end(); ++it)
-                if (it->id == id) { q.erase(it); break; }
             if (q.empty()) {
                 if (buy) bids_.erase(px); else asks_.erase(px);
             }
