mutants/raft-01-figure8-commit-older-term-by-count.patch
# mutant: raft-01-figure8-commit-older-term-by-count
# file: src/raft.hpp
# rule: section 5.4.2 / figure 2 leader rule 4: a leader may only advance
#       commitIndex over entries OF ITS OWN TERM by counting replicas
# breaks: advance_commit() drops the term guard, so an older-term entry is
#         committed by replica count alone -- the canonical figure-8 bug; a
#         later leader without that entry can erase it after it was "committed"
# expected killer: test_raft unit_figure8 (ledger oracle, test_raft.cpp:58-60);
#                  the seeded partition/crash scenarios via invariant 3 (ledger)
# provenance: reconstructed (README "Deleting the figure-8 guard", round 1
#             survivor at 8,000 universes; test_raft.cpp:4-6)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -219,7 +219,6 @@
         // canonical Raft bug (figure 8): a later leader without that entry
         // can erase it after it was already "committed".
         for (Index n = last_index(); n > commit_; --n) {
-            if (term_at(n) != p_.current_term) break;
             int cnt = 0;
             for (NodeId peer = 0; peer < n_; ++peer)
                 cnt += (match_[peer] >= n);
