mutants/raft-02-blind-truncation-at-prev-index.patch
# mutant: raft-02-blind-truncation-at-prev-index
# file: src/raft.hpp
# rule: figure 2 AppendEntries receiver step 3: truncate ONLY on a real term
#       conflict, never blindly at prevLogIndex
# breaks: the follower discards everything after prevLogIndex on every
#         AppendEntries, so a stale-but-valid retransmission carrying a shorter
#         prefix erases already-appended (even committed) entries
# expected killer: test_raft unit_stale_ae_retransmission (test_raft.cpp:154-156);
#                  scenario reorder_dup (delays > heartbeat + duplication) via
#                  invariant 2 (commit beyond log) or 3 (ledger)
# provenance: reconstructed (README "Blind log truncation", round 1 survivor;
#             test_raft.cpp:574-575)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -323,15 +323,8 @@
                 // Append, truncating on the FIRST conflict only (figure 2
                 // step 3): blind truncation at prev_log_index would discard
                 // entries a stale-but-valid retransmission never carried.
-                Index idx = r.prev_log_index;
-                for (const auto& e : r.entries) {
-                    ++idx;
-                    if (idx <= last_index() &&
-                        term_at(idx) != e.term) {
-                        p_.log.resize(static_cast<size_t>(idx - 1));
-                    }
-                    if (idx > last_index()) p_.log.push_back(e);
-                }
+                p_.log.resize(static_cast<size_t>(r.prev_log_index));
+                for (const auto& e : r.entries) p_.log.push_back(e);
                 if (r.leader_commit > commit_) {
                     Index cap = r.prev_log_index + r.entries.size();
                     commit_ = std::min(r.leader_commit,
