mutants/raft-04-election-quorum-half-is-majority.patch
# mutant: raft-04-election-quorum-half-is-majority
# file: src/raft.hpp
# rule: section 5.2: a candidate wins with votes from a MAJORITY of the cluster
# breaks: maybe_win() accepts exactly half the votes, so on an even cluster two
#         candidates with 2/4 each are both elected in the same term
# expected killer: test_raft unit_elect_quorum (n=2 self-vote, n=4 split brain);
#                  scenario even_split (n=4 partitioned 2-2, test_raft.cpp:680-)
#                  via "half a cluster elected a new leader without quorum"
# provenance: reconstructed (README round 2 "every seeded cluster size was odd,
#             where > and >= majorities coincide, which hid an election-quorum
#             off-by-one")
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -188,7 +188,7 @@
     void maybe_win(std::uint64_t now_ms, std::vector<Message>& out) {
         int cnt = 0;
         for (bool v : votes_) cnt += v;
-        if (role_ == Role::Candidate && cnt * 2 > n_)
+        if (role_ == Role::Candidate && cnt * 2 >= n_)
             become_leader(now_ms, out);
     }
 
