mutants/raft-05-commit-quorum-half-is-majority.patch
# mutant: raft-05-commit-quorum-half-is-majority
# file: src/raft.hpp
# rule: figure 2 leader rule 4: commit requires matchIndex[i] >= N on a MAJORITY
# breaks: advance_commit() counts exactly half the cluster as a quorum, so a
#         2-of-4 partition (or a 1-of-2 cluster) commits without a majority
# expected killer: test_raft unit_minority_stall (n=2: no commit alone);
#                  scenario even_split via "half a cluster committed without a quorum"
# provenance: candidate (the round-2 off-by-one is named for elections; the
#             even_split test also pins the commit half, so both are shipped)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -223,7 +223,7 @@
             int cnt = 0;
             for (NodeId peer = 0; peer < n_; ++peer)
                 cnt += (match_[peer] >= n);
-            if (cnt * 2 > n_) { commit_ = n; break; }
+            if (cnt * 2 >= n_) { commit_ = n; break; }
         }
     }
 
