mutants/raft-06-no-vote-reset-on-term-bump.patch
# mutant: raft-06-no-vote-reset-on-term-bump
# file: src/raft.hpp
# rule: figure 2 "all servers": on seeing a higher term, set currentTerm and
#       convert to follower -- which resets votedFor for the new term
# breaks: become_follower() bumps the term but keeps the old votedFor, so a
#         node that voted for A in term 5 cannot vote in term 6 unless A asks
#         again -- and (the mirror hazard the comment at raft.hpp:139-142
#         names) a stale votedFor across a bump is how double votes happen
# expected killer: test_raft unit_double_vote ("term bump resets the vote")
# provenance: candidate (rule is called out at raft.hpp:139-142 as a classic
#             mutant-class bug; not named as one of the twelve)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -142,7 +142,6 @@
         // bump, which breaks Election Safety.
         if (t > p_.current_term) {
             p_.current_term = t;
-            p_.voted_for.reset();
         }
         // A deposed leader or candidate waits a full randomized timeout
         // before campaigning again. Its old deadline is long expired, and
