mutants/raft-10-candidate-no-stepdown-on-equal-term-ae.patch
# mutant: raft-10-candidate-no-stepdown-on-equal-term-ae
# file: src/raft.hpp
# rule: section 5.2: a candidate that receives AppendEntries from a leader of
#       at least its own term recognises the leader and returns to follower
# breaks: the candidate stays a candidate on an equal-term AppendEntries, so
#         a split-vote loser keeps campaigning and re-elects against a live
#         leader at every timeout
# expected killer: test_raft unit_candidate_stepdown
# provenance: candidate (rule and test are in the tree; not named as one of
#             the twelve)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -313,7 +313,6 @@
         } else {
             // Valid leader for this term: candidates step down, followers
             // reset their election timer.
-            if (role_ == Role::Candidate) role_ = Role::Follower;
             leader_hint_ = r.leader;
             deadline_ = now_ms + timeout_ms_;
             if (r.prev_log_index > last_index() ||
