mutants/raft-11-follower-commit-unclamped.patch
# mutant: raft-11-follower-commit-unclamped
# file: src/raft.hpp
# rule: figure 2 AppendEntries receiver step 5: commitIndex =
#       min(leaderCommit, index of last new entry)
# breaks: the follower takes leaderCommit verbatim, so a leader that pages its
#         suffix (or any leader_commit beyond the carried entries) pushes the
#         follower's commit index past the end of its log
# expected killer: test_raft unit_commit_clamp (test_raft.cpp:352-356, which
#                  records that inside the closed system the clamp is dead code
#                  because this leader ships the full suffix: the seeded
#                  universes cannot kill this one, the scripted test must)
# provenance: reconstructed (test_raft.cpp:352-356)
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -332,12 +332,7 @@
                     }
                     if (idx > last_index()) p_.log.push_back(e);
                 }
-                if (r.leader_commit > commit_) {
-                    Index cap = r.prev_log_index + r.entries.size();
-                    commit_ = std::min(r.leader_commit,
-                                       std::max(cap, commit_));
-                    if (commit_ > last_index()) commit_ = last_index();
-                }
+                if (r.leader_commit > commit_) commit_ = r.leader_commit;
                 ar.success = true;
                 ar.match_hint = r.prev_log_index + r.entries.size();
             }
