mutants/raft-12-stale-ae-reply-term-guard-dropped.patch
# mutant: raft-12-stale-ae-reply-term-guard-dropped
# file: src/raft.hpp
# rule: figure 2 rules for servers: an RPC reply belongs to the term it was
#       sent in; a leader must ignore replies to a previous term's requests
# breaks: a re-elected leader accepts AppendEntries replies from its earlier
#         term, so a stale success reply raises matchIndex for entries the
#         follower may no longer hold and lets advance_commit() count them
# expected killer: test_raft unit_stale_ae_reply (scripted: a term-1 success
#                  reply held across two leader changes lands on the term-3
#                  leader after its log was truncated and refilled)
# provenance: candidate that SURVIVED the suite as it stood: all 4,550 raft
#             universes and 450 exchange universes passed with this mutant
#             (slow_wire's 400 ms delays never span two leader changes plus
#             a partial replication). unit_stale_ae_reply was written to kill
#             it; see mutants/README.md.
#
# Generated by mutants/regen.sh; edit the substitution there, not this file.
--- a/src/raft.hpp
+++ b/src/raft.hpp
@@ -352,7 +352,7 @@
             become_follower(r.term, now_ms);
             return;
         }
-        if (role_ != Role::Leader || r.term != p_.current_term) return;
+        if (role_ != Role::Leader) return;
         if (r.success) {
             if (r.match_hint > match_[m.from]) {
                 match_[m.from] = r.match_hint;
